staubify_backend/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo-lition"], ["LIMIT", 1]]
---
    def self.find_by_credentials(cred, password)
        #debugger
        if(cred =~ URI::MailTo::EMAIL_REGEXP)
          user = User.find_by(email: cred)
        else
          user = User.find_by(username: cred)