staubify_backend/app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)

        debugger

        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "email", "created_at", "updated_at", "birthday") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"